[
    {
        "title": "WeChats newsfeed turns 10. Is it still relevant?",
        "post_text": "Over the last few days, my WeChat has been inundated with people reminiscing about the first post they ever published on the apps newsfeed, which marked its 10-year anniversary this week. The newsfeed feature, called Moments, is like a social network that lives within the WeChat super app. Unlike many other social networks, which either die down over time or have fallen from grace among their original users like Facebook, Moments has managed to stay relevant.",
        "user_id": 5
    },
    {
        "title": "Tesla expects gigafactories to run below capacity through 2022",
        "post_text": "Tesla said Wednesday that a prolonged supply chain crunch has limited production capacity at its factories and expects the pain to continue through the rest of the year. “Our own factories have been running below capacity for several quarters as supply chain became the main limiting factor, which is likely to continue through the rest of 2022,” Tesla said. Tesla included the warnings in its first-quarter earnings report, which beat analyst expectations on income and revenue and sent shares higher in after-hours trading. Tesla reported $3.32 billion of net income, a 658% increase from the $438 million reported for the same period last year. Tesla also reported revenues of $18.75 billion. Per data from Yahoo Finance, analysts expected that Tesla would generate Q1 2022 revenues of $17.8 billion, and $2.26 in earnings per share.",
        "user_id": 3
    },
    {
        "title": "SQLite is embedded everywhere. Will Postgres follow suit?",
        "post_text": "SQLite is the world's most widely-deployed database engine. Its in your phone, its in your browser, and if you search your computer youll find its .db files there too. SQLite was inspired by Postgres. Its author Richard Hipp has called SQLite a “conceptual fork” of Postgres. Theres no shared code, but Postgres was the north star to which he aligned SQLite. ",
        "user_id": 1
    },
    {
        "title": "7 ways to avoid a cloud misconfiguration attack",
        "post_text": "Cloud engineering and security teams need to ask some important questions about the security of their cloud environments, and they must go well beyond whether or not environments are passing compliance audits. Within minutes of your adding a new endpoint to the internet, a potential attacker has scanned it and assessed its exploitability. A single cloud misconfiguration could put a target on your organizations back—and put your data at risk.",
        "user_id": 2
    }
]